from django.shortcuts import render
from django.http import JsonResponse
from django.views.decorators.csrf import csrf_exempt
import json
# Create your views here.


def round(x, y, z, a, b, c):
    x = int(x)
    y = int(y)
    z = int(z)
    a = int(a)
    b = int(b)
    c = int(c)
    r = (x-a)*(x-a)+(y-b)*(y-b)+(z-c)*(z-c)
    return r


@csrf_exempt
def calculator(request):
    # 데이터 확인
    x = request.GET.get('x')  # 가격
    y = request.GET.get('y')  # 맛
    z = request.GET.get('z')  # 양
    drink = request.GET.get('drink')  # 술
    delivery = request.GET.get('delivery')  # 배달
    category = request.GET.get('category')  # 메뉴

    # 저장된 값.
    # ex) category 0 한식 1 일식 2중식 3양식 4치킨
    # ex) drink,delivery 0 가능 1 불가능
    # menulist x,y,z,delivery, category
    menulist = [
        [48, 73, 0, 1, 0],  # 낙지도가
        [56, 76, 0, 1, 0],  # 성수식당
        [76, 74, 0, 0, 0],  # 로뎀식당
        [59, 67, 0, 1, 0],  # 백채김치찌개
        [63, 76, 0, 0, 0],  # 명동찌개마을
        [56, 67, 0, 1, 0],  # 돈피그
        [44, 63, 0, 1, 0],  # 돼지가예술
        [62, 77, 0, 0, 0],  # 호가
        [50, 71, 0, 1, 0],  # 중앙정육식당
        [52, 74, 0, 1, 0],  # 진성곱창
        [57, 73, 1, 0, 0],  # 샤브향
        [49, 83, 1, 0, 0],  # 산채가
        [46, 79, 0, 0, 0],  # 대만족
        [49, 81, 0, 0, 0],  # 보쌈주는족발짐
        [62, 69, 0, 0, 0],  # 원할머니보쌈
        [52, 76, 0, 0, 0],  # 진성부대찌개
        [53, 73, 1, 0, 0],  # 두찜
        [48, 66, 0, 0, 0],  # 대박삼겹김치찜
        [49, 70, 0, 1, 0],  # 왕십리 야채곱창
        [65, 71, 1, 0, 0],  # 엄마손칼국수(칼국수)
        [62, 79, 1, 0, 0],  # 엽떡
        [65, 79, 1, 0, 0],  # 신천떡볶이
        [67, 60, 1, 0, 0],  # 명수당분식
        [71, 61, 1, 1, 0],  # 이태리식당
        [56, 64, 0, 0, 0],  # 당신
        [86, 80, 1, 1, 0],  # 리오브리또
        [56, 73, 1, 0, 0],  # 청년피자
        [64, 69, 1, 0, 0],  # 피자보이
        # [68,64], # 더더피자
        [73, 78, 1, 1, 0],  # 맘스터치
        [57, 57, 1, 0, 0],  # 666버거
        [72, 70, 1, 0, 0],  # 롯데리아
        [68, 75, 0, 0, 0],  # 이백장돈까스
        [59, 75, 1, 0, 0],  # 미가초밥
        [58, 57, 1, 0, 0],  # 스시어게인
        [50, 68, 0, 1, 0],  # 고인돌횟집
        [73, 79, 1, 1, 0],  # 엄마손칼국수(돈까스)
        [61, 62, 0, 0, 0],  # 교촌치킨
        [68, 70, 0, 0, 0],  # BHC
        [66, 69, 0, 0, 0],  # 전설의치킨
        [76, 80, 0, 0, 0],  # 미쳐버린파닭
        [62, 68, 0, 0, 0],  # BBQ
        [67, 75, 0, 0, 0],  # 페리카나
        [73, 79, 0, 0, 0],  # 치킨마루
        [67, 66, 0, 0, 0],  # 지코바
        # [73,76,0,0], # 신통치킨
        [55, 76, 0, 0, 0],  # 모현양꼬치
        [73, 67, 0, 0, 0],  # 상원
        [76, 68, 0, 0, 0],  # 차이나타운
        [74, 81, 0, 0, 0],  # 야미마라탕
        [79, 67, 0, 0, 0],  # 모현각
        [70, 81, 0, 0, 0],  # 마라장룡

    ]
    # 순서대로 가격, 맛, 양, 배달, 술, 메뉴
    menuname = [
        ['음식점a', 'a설명'],
        ['낙지도가'],
        ['성수식당'],
        ['로뎀식당'],
        ['백체김치찌개'],
        ['명동찌개마을'],
        ['돈피그'],
        ['돼지가예술'],
        ['호가'],
        ['정육정육식당'],
        ['진성정육식당'],
        ['진성곱창'],
        ['샤브향'],
        ['산채가'],
        ['대만족'],
        ['보쌈주는족발집'],
        ['원할머니보쌈'],
        ['진성부대찌개'],
        ['그집곱도리탕'],
        ['두찜'],
        ['대박삼겹김치찜'],
        ['왕십리 야채곱창'],
        ['엄마손칼국수(칼국수)'],
        ['엽떡'],
        ['신전떡볶이'],
        ['명수당분식'],
        ['이태리식당'],
        ['당신'],
        ['리오브리또'],
        ['청년피자'],
        ['피자보이'],
        # ['더더피자'],
        ['맘스터치'],
        ['666버거'],
        ['롯데리아'],
        ['이백장돈까스'],
        ['미가초밥'],
        ['스시어게인'],
        ['고인돌횟집'],
        ['엄마손칼국수(돈까스)'],
        ['교촌치킨'],
        ['BHC'],
        ['전설의치킨'],
        ['미쳐버린파닭'],
        ['BBQ'],
        ['페리카나'],
        ['치킨마루'],
        ['지코바'],
        # ['신통치킨'],
        ['모현양꼬치'],
        ['상원'],
        ['차이나타운'],
        ['모현각'],
        ['마라장룡'],



    ]
    store = ''
    explan = ''
    # 계산
    shortlength = 40000
    resultnum = 6
    for i in range(len(menulist)):
        if (menulist[i][3] == int(drink) and menulist[i][4] == int(delivery)):
            if (menulist[i][5] == int(category)):
                length = round(
                    x, y, z, menulist[i][0], menulist[i][1], menulist[i][2])
                if (shortlength >= length):
                    shortlength = length
                    resultnum = i

    store = menuname[resultnum][0]
    explan = menuname[resultnum][1]

    # 응답
    return render(request, 'calculator.html', {'store': store, 'explan': explan})
